/*
 Navicat Premium Data Transfer

 Source Server         : 本地mysql
 Source Server Type    : MySQL
 Source Server Version : 50732
 Source Host           : localhost
 Source Database       : quick_cms

 Target Server Type    : MySQL
 Target Server Version : 50732
 File Encoding         : utf-8

 Date: 06/26/2021 16:39:16 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `ad_materials`
-- ----------------------------
DROP TABLE IF EXISTS `ad_materials`;
CREATE TABLE `ad_materials` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) DEFAULT NULL COMMENT '标题',
  `desc` varchar(255) DEFAULT NULL COMMENT '简介',
  `thumbnail` varchar(255) DEFAULT NULL COMMENT '缩略图',
  `link` varchar(100) DEFAULT NULL COMMENT '链接',
  `position` tinyint(4) DEFAULT '1' COMMENT '展示位置 1首页 2其它',
  `status` tinyint(4) DEFAULT NULL COMMENT '数据状态1正常0删除',
  `created` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `ad_materials`
-- ----------------------------
BEGIN;
INSERT INTO `ad_materials` VALUES ('1', '测试轮播1测试轮播1测试轮播1测试轮播1', '测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1测试轮播1', 'http://static.sscmgroup.com/news/a57c8fe0-29be-4969-a959-9ef6bda079f0.jpg', '123', '1', '1', '2021-06-16 10:09:44', '2021-06-18 14:23:13'), ('2', '测试轮播2', '测试轮播2测试轮播2测试轮播2测试轮播2测试轮播2测试轮播2测试轮播2测试轮播2测试轮播2测试轮播2', 'http://static.sscmgroup.com/news/129b6037-c2af-48f8-a8c2-026a1b8fd6dc.jpg', '1234', '1', '1', '2021-06-16 15:58:25', '2021-06-18 14:23:25'), ('3', '测试轮播3', '测试轮播3测试轮播3测试轮播3测试轮播3', 'http://static.sscmgroup.com/news/52a6ac64-8f55-425c-8f2f-4f3e8e874172.jpg', '1234', '1', '1', '2021-06-18 14:23:50', '2021-06-18 14:23:50'), ('4', '测试轮播4', '测试轮播4测试轮播4测试轮播4测试轮播4', 'http://static.sscmgroup.com/news/9300b1a5-fb0f-4b83-8850-9c0c99cf96a2.jpg', '', '1', '1', '2021-06-18 14:24:12', '2021-06-18 14:24:12');
COMMIT;

-- ----------------------------
--  Table structure for `news_category`
-- ----------------------------
DROP TABLE IF EXISTS `news_category`;
CREATE TABLE `news_category` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) DEFAULT '0' COMMENT '父级分类id',
  `name` varchar(100) DEFAULT NULL COMMENT '分类名',
  `status` tinyint(2) DEFAULT '1' COMMENT '数据状态1正常0删除',
  `created` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '最后更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `news_category`
-- ----------------------------
BEGIN;
INSERT INTO `news_category` VALUES ('1', '0', '软件产品', '1', '2021-06-12 10:26:35', '2021-06-18 21:32:04'), ('2', '1', '海运、空运', '1', '2021-06-15 10:04:06', '2021-06-15 10:47:27'), ('3', '0', '公司新闻', '1', '2021-06-15 10:48:18', '2021-06-19 13:46:31'), ('4', '0', '服务', '1', '2021-06-15 10:48:59', '2021-06-18 23:29:28'), ('5', '0', '核心优势', '1', '2021-06-18 20:53:40', '2021-06-18 20:53:40');
COMMIT;

-- ----------------------------
--  Table structure for `news_contents`
-- ----------------------------
DROP TABLE IF EXISTS `news_contents`;
CREATE TABLE `news_contents` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `news_id` int(10) DEFAULT '0' COMMENT '新闻ID',
  `content` text,
  `status` tinyint(2) DEFAULT '1' COMMENT '数据状态1正常0删除',
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `news_contents`
-- ----------------------------
BEGIN;
INSERT INTO `news_contents` VALUES ('1', '1', '<p>核心优势1核心优势1核心优势1核心优势1核心优势1</p>', '0', '2021-06-13 00:27:06', '2021-06-13 00:27:06'), ('2', '2', '<p>由专业客服提供人工服务</p>\n<p>负责疑难问题和故障受理</p>\n<p>由专业客服提供人工服务</p>\n<p>负责疑难问题和故障受理</p>', '0', '2021-06-13 00:44:05', '2021-06-13 00:44:05'), ('3', '3', '<p>新闻3<img class=\"img-fluid w-100\" src=\"http://static.sscmgroup.com/news/09d9bab4-c95f-4e7f-9ea0-7a646f9f806d.jpg\" /></p>', '0', '2021-06-14 21:53:04', '2021-06-14 21:53:04'), ('4', '4', '<p>新闻4</p>', '0', '2021-06-15 10:22:08', '2021-06-15 10:22:08'), ('5', '5', '<p>软件产品1软件产品1软件产品1软件产品1软件产品1软件产品1软件产品1</p>', '0', '2021-06-18 21:32:43', '2021-06-18 21:32:43'), ('6', '6', '<p>软件产品2软件产品2软件产品2软件产品2软件产品2软件产品2</p>', '0', '2021-06-18 21:33:06', '2021-06-18 21:33:06'), ('7', '7', '<p>软件产品3软件产品3软件产品3软件产品3软件产品3软件产品3软件产品3软件产品3软件产品3软件产品3</p>', '0', '2021-06-18 21:33:30', '2021-06-18 21:33:30'), ('8', '8', '<p>软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发软件定制开发</p>', '0', '2021-06-19 10:19:09', '2021-06-19 10:19:09'), ('9', '9', '<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>\n<pre>IT外包服务</pre>', '0', '2021-06-19 10:19:51', '2021-06-19 10:19:51'), ('10', '10', '<p>网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设网上商城建设</p>', '0', '2021-06-19 10:20:38', '2021-06-19 10:20:38'), ('11', '11', '<p>iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发iOS应用定制开发</p>', '0', '2021-06-19 10:21:23', '2021-06-19 10:21:23'), ('12', '12', '<pre>为计算程序拟定&ldquo;算法&rdquo;，写作的第四份&ldquo;程序设计流程图&rdquo;，被珍视为&ldquo;第一位给计算机</pre>\n<pre>为计算程序拟定&ldquo;算法&rdquo;，写作的第四份&ldquo;程序设计流程图&rdquo;，被珍视为&ldquo;第一位给计算机</pre>\n<pre>为计算程序拟定&ldquo;算法&rdquo;，写作的第四份&ldquo;程序设计流程图&rdquo;，被珍视为&ldquo;第一位给计算机</pre>', '0', '2021-06-19 13:47:28', '2021-06-19 13:47:28'), ('13', '13', '<pre>为计算程序拟定&ldquo;算法&rdquo;，写作的第四份&ldquo;程序设计流程图&rdquo;，被珍视为&ldquo;第一位给计算机</pre>\n<pre>为计算程序拟定&ldquo;算法&rdquo;，写作的第四份&ldquo;程序设计流程图&rdquo;，被珍视为&ldquo;第一位给计算机</pre>\n<pre>为计算程序拟定&ldquo;算法&rdquo;，写作的第四份&ldquo;程序设计流程图&rdquo;，被珍视为&ldquo;第一位给计算机</pre>\n<pre>为计算程序拟定&ldquo;算法&rdquo;，写作的第四份&ldquo;程序设计流程图&rdquo;，被珍视为&ldquo;第一位给计算机</pre>\n<pre>为计算程序拟定&ldquo;算法&rdquo;，写作的第四份&ldquo;程序设计流程图&rdquo;，被珍视为&ldquo;第一位给计算机</pre>', '0', '2021-06-19 13:48:14', '2021-06-19 13:48:14'), ('14', '14', '14', '1', '2021-06-19 13:55:39', '2021-06-19 13:55:39'), ('15', '15', '15', '1', '2021-06-19 13:56:18', '2021-06-19 13:56:18'), ('16', '16', '16', '1', '2021-06-19 13:56:25', '2021-06-19 13:56:25'), ('17', '17', '17', '1', '2021-06-19 13:56:31', '2021-06-19 13:56:31'), ('18', '18', '18', '1', '2021-06-19 13:56:38', '2021-06-19 13:56:38'), ('19', '19', '19', '1', '2021-06-19 13:56:43', '2021-06-19 13:56:46'), ('20', '20', '20', '1', '2021-06-19 13:56:52', '2021-06-19 13:56:52'), ('21', '21', '21', '1', '2021-06-19 13:56:57', '2021-06-19 13:56:57'), ('22', '22', '22', '1', '2021-06-19 13:57:02', '2021-06-19 13:57:02'), ('23', '23', '23', '1', '2021-06-19 13:57:08', '2021-06-19 13:57:08'), ('24', '24', '24', '1', '2021-06-19 13:57:19', '2021-06-19 13:57:19');
COMMIT;

-- ----------------------------
--  Table structure for `news_titles`
-- ----------------------------
DROP TABLE IF EXISTS `news_titles`;
CREATE TABLE `news_titles` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `cate_id` int(10) DEFAULT NULL COMMENT '分类ID',
  `title` varchar(100) DEFAULT NULL COMMENT '新闻标题',
  `desc` varchar(255) DEFAULT NULL COMMENT '简介',
  `thumbnail` varchar(255) DEFAULT NULL COMMENT '缩略图',
  `news_type` tinyint(4) DEFAULT '0' COMMENT '类型 0 默认 1推荐 2热门',
  `status` tinyint(2) DEFAULT '1' COMMENT '数据状态1正常0删除',
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=25 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `news_titles`
-- ----------------------------
BEGIN;
INSERT INTO `news_titles` VALUES ('1', '5', '核心优势1', '由专业客服提供人工服务\n负责疑难问题和故障受理', 'http://static.sscmgroup.com/news/766e13b3-3dfd-42e2-8fcc-88594b391a0f.jpg', '1', '1', '2021-06-13 00:27:06', '2021-06-18 20:57:02'), ('2', '5', '核心优势2', '由专业客服提供人工服务\n负责疑难问题和故障受理', 'http://static.sscmgroup.com/news/859ebb8a-b619-4ec7-85d3-1f2348f79d8e.jpg', '0', '1', '2021-06-13 00:44:05', '2021-06-18 20:58:00'), ('3', '5', '核心优势3', '由专业客服提供人工服务\n负责疑难问题和故障受理', 'http://static.sscmgroup.com/news/f3264e8e-8a8e-494a-9760-7911eb68115a.jpg', '0', '1', '2021-06-14 21:53:04', '2021-06-18 21:25:56'), ('4', '5', '核心优势4', '利用远程视频工具，提供协助\n帮助客户进行调试、解决故障', 'http://static.sscmgroup.com/news/8b8c6ca2-c7b3-48be-9c26-2a253225fc48.jpg', '0', '1', '2021-06-15 10:22:08', '2021-06-18 21:26:13'), ('5', '1', '软件产品1', '软件产品1软件产品1软件产品1', '', '0', '1', '2021-06-18 21:32:43', '2021-06-18 21:32:43'), ('6', '1', '软件产品2', '软件产品2软件产品2软件产品2', '', '0', '1', '2021-06-18 21:33:06', '2021-06-18 21:33:06'), ('7', '1', '软件产品3', '软件产品3软件产品3软件产品3软件产品3', '', '0', '1', '2021-06-18 21:33:30', '2021-06-18 21:33:30'), ('8', '4', '软件定制开发', 'Customize App', 'http://static.sscmgroup.com/news/497c960e-136c-465d-957e-de485a8825a7.jpg', '0', '1', '2021-06-19 10:19:09', '2021-06-19 10:19:09'), ('9', '4', 'IT外包服务', 'Outsourcing', 'http://static.sscmgroup.com/news/8cbd1575-3e52-4504-b60a-e1c6f9e208f4.jpg', '0', '1', '2021-06-19 10:19:51', '2021-06-19 10:19:51'), ('10', '4', '网上商城建设', 'eCommerce Site', 'http://static.sscmgroup.com/news/7d53ceea-7c7b-41fc-ac43-3715ca514170.jpg', '0', '1', '2021-06-19 10:20:38', '2021-06-19 10:20:38'), ('11', '4', 'iOS应用定制开发', 'iOS App Dev', 'http://static.sscmgroup.com/news/3170d8d1-447c-4aa2-92df-a5eed5019740.jpg', '0', '1', '2021-06-19 10:21:23', '2021-06-19 10:21:23'), ('12', '3', '世界上第一个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', '', '0', '1', '2021-06-19 13:47:28', '2021-06-19 13:47:28'), ('13', '3', '世界上第二个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', '', '0', '1', '2021-06-19 13:48:14', '2021-06-19 13:48:14'), ('14', '3', '世界上第三个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:48:14', '2021-06-19 13:51:21'), ('15', '3', '世界上第4个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:51:29', '2021-06-19 13:51:44'), ('16', '3', '世界上第5个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:52:16', '2021-06-19 13:52:23'), ('17', '3', '世界上第6个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:52:41', '2021-06-19 13:52:47'), ('18', '3', '世界上第7个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:52:53', '2021-06-19 13:53:05'), ('19', '3', '世界上第8个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:53:16', '2021-06-19 13:53:27'), ('20', '3', '世界上第9个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:53:32', '2021-06-19 13:53:41'), ('21', '3', '世界上第10个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:53:47', '2021-06-19 13:53:57'), ('22', '3', '世界上第11个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:54:02', '2021-06-19 13:54:16'), ('23', '3', '世界上第12个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:54:23', '2021-06-19 13:54:42'), ('24', '3', '世界上第13个程序员', '为计算程序拟定“算法”，写作的第四份“程序设计流程图”，被珍视为“第一位给计算机', null, '0', '1', '2021-06-19 13:54:47', '2021-06-19 13:55:24');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
